nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                        # 0
  - [-1, 1, ContextGuidedConv, [128]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]                # 2
  - [-1, 1, ContextGuidedConv, [256]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]                # 4
  - [-1, 1, ContextGuidedConv, [512]]          # 5
  - [-1, 2, C3k2, [512, True]]                       # 6
  - [-1, 1, ContextGuidedConv, [1024]]         # 7
  - [-1, 2, C3k2, [1024, True]]                      # 8
  - [-1, 1, SPPF, [1024, 5]]                         # 9
  - [-1, 2, C2PSA, [1024]]                           # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11
  - [[-1, 6], 1, Concat, [1]]                        # 12
  - [-1, 2, C3k2, [512, False]]                      # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 14
  - [[-1, 4], 1, Concat, [1]]                        # 15
  - [-1, 2, C3k2, [256, False]]                      # 16

  - [-1, 1, ContextGuidedConv, [256]]          # 17
  - [[-1, 13], 1, Concat, [1]]                       # 18
  - [-1, 2, C3k2, [512, False]]                      # 19

  - [-1, 1, ContextGuidedConv, [512]]          # 20
  - [[-1, 10], 1, Concat, [1]]                       # 21
  - [-1, 2, C3k2, [1024, True]]                      # 22

  - [[16, 19, 22], 1, Detect, [nc]]                  # 23