nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [10, 1, SFEContextGuide, [1024]]        # 11 (P5_SFE)
  - [6, 1, SFEContextGuide, [512]]         # 12 (P4_SFE)
  - [4, 1, SFEContextGuide, [512]]         # 13 (P3_SFE)

  - [11, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 12], 1, Concat, [1]]          # 15
  - [-1, 2, C3k2, [512, False]]         # 16 (P4 feature)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 13], 1, Concat, [1]]          # 18
  - [-1, 2, C3k2, [256, False]]         # 19 (P3 feature / Out small)

  - [-1, 1, Conv, [256, 3, 2]]          # 20
  - [[-1, 16], 1, Concat, [1]]          # 21
  - [-1, 2, C3k2, [512, False]]         # 22 (P4 feature / Out medium)

  - [-1, 1, Conv, [512, 3, 2]]          # 23
  - [[-1, 11], 1, Concat, [1]]          # 24
  - [-1, 2, C3k2, [1024, True]]         # 25 (P5 feature / Out large)

  - [[19, 22, 25], 1, Detect, [nc]]     # 26