nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]            # 9-P5/32
  - [-1, 2, C2PSA, [1024]]              # 10-P5/32

head:
  - [6, 1, SFEContextGuide, [512]]      # 11 (P4 Context)
  - [4, 1, SFEContextGuide, [256]]      # 12 (P3 Context)
  - [2, 1, SFEContextGuide, [128]]      # 13 (P2 Context)

  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (P5 -> P4 size)
  - [[-1, 11], 1, Concat, [1]]                 # 15
  - [-1, 1, C3k2, [512, False]]                # 16 (最终 P4 特征)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (P4 -> P3 size)
  - [[-1, 12], 1, Concat, [1]]                 # 18
  - [-1, 1, C3k2, [256, False]]                # 19 (中间 P3 特征)
  - [[-1, 16], 1, StepwiseContextGuide, [4]]   # 20 (增强 P3: 融合 P3+P4)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21 (P3 -> P2 size)
  - [[-1, 13], 1, Concat, [1]]                 # 22
  - [-1, 1, C3k2, [128, False]]                # 23 (中间 P2 特征)
  - [[-1, 20], 1, StepwiseContextGuide, [4]]   # 24 (增强 P2: 融合 P2+P3)

  - [[24, 20, 16], 1, Detect, [nc]]            # 25 (检测 P2, P3, P4)