nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12 (直接拼接层6: P4)
  - [-1, 2, C3k2, [512, False]]                # 13 (融合后的 P4)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15 (直接拼接层4: P3)
  - [-1, 2, C3k2, [256, False]]                # 16 (融合后的 P3)

  - [10, 2, C3k2, [1024, True]]                # 17 (P5 最终特征)

  - [[16, 13, 17], 1, Detect, [nc]]            # 18