nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'n'
  n: [0.50, 0.25, 1024]

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, WTDConv, [256]]     # 3 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, WTDConv, [512]]     # 5 P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7 P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # cat backbone P4
  - [-1, 2, C3k2, [512, False]]    # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # cat backbone P3
  - [-1, 2, C3k2, [256, False]]    # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]     # cat head P4
  - [-1, 2, C3k2, [512, False]]    # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]      # cat head P5
  - [-1, 2, C3k2, [1024, True]]    # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)