nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  # === 1. 横向连接 (Lateral Connections) - 改回标准 Conv ===
  # 作用：调整通道数以匹配融合层，不包含复杂注意力
  - [6, 1, Conv, [512, 1]]      # 11 (P4) 1x1卷积, 保持 512 通道
  - [4, 1, Conv, [256, 1]]      # 12 (P3) 1x1卷积, 保持 256 通道
  - [2, 1, Conv, [128, 1]]      # 13 (P2) 1x1卷积, 256->128 通道 (关键降维)

  # === 2. 自顶向下 FPN (P5 -> P4 -> P3 -> P2) ===
  # 结构保持完全不变，只改变了上面的输入源

  # --- P5 -> P4 ---
  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 11], 1, Concat, [1]]                 # 15 (拼接 P4 普通特征)
  - [-1, 1, C3k2, [512, False]]                # 16

  # --- P4 -> P3 ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 12], 1, Concat, [1]]                 # 18 (拼接 P3 普通特征)
  - [-1, 1, C3k2, [256, False]]                # 19

  # --- P3 -> P2 ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [[-1, 13], 1, Concat, [1]]                 # 21 (拼接 P2 普通特征)
  - [-1, 1, C3k2, [128, False]]                # 22

  # === 3. 检测头 ===
  - [[22, 19, 16], 1, Detect, [nc]]            # 23