# Parameters
nc: 80
scales:
  n: [0.50,0.25,1024]

backbone:
  - [-1,1,Conv,[64,3,2]]                                 # 0
  - [-1,1,Conv,[128,3,2]]                                # 1
  - [-1,2,C3k2,[256,False,0.25]]                         # 2
  - [-1,1,Conv,[256,3,2]]                                # 3
  - [-1,2,C3k2,[512,False,0.25]]                         # 4
  - [-1,1,Conv,[512,3,2]]                                # 5
  - [-1,2,C3k2,[512,True]]                               # 6
  - [-1,1,Conv,[1024,3,2]]                               # 7
  - [-1,2,C3k2,[1024,True]]                              # 8
  - [-1,1,SPPF,[1024,5]]                                 # 9
  - [-1,2,C2PSA,[1024]]                                  # 10
  - [-1,2,ECA,[]]                                    # 11

head:
  - [-1,1,nn.Upsample,[None,2,"nearest"]]                # 12
  - [[-1,6],1,Concat,[1]]                                # 13
  - [-1,2,C3k2,[512,False]]                              # 14

  - [-1,1,nn.Upsample,[None,2,"nearest"]]                # 15
  - [[-1,4],1,Concat,[1]]                                # 16
  - [-1,2,C3k2,[256,False]]                              # 17

  - [-1,1,Conv,[256,3,2]]                                # 18
  - [[-1,14],1,Concat,[1]]                               # 19
  - [-1,2,C3k2,[512,False]]                              # 20

  - [-1,1,Conv,[512,3,2]]                                # 21
  - [[-1,11],1,Concat,[1]]                               # 22
  - [-1,2,C3k2,[1024,True]]                              # 23

  - [[17,20,23],1,Detect,[nc]]                           # 24