nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]   # 11  P5 -> up to P4
  - [[-1, 6], 1, Concat, [1]]                    # 12  concat(P5_up, P4_backbone)
  - [-1, 1, SFEContextGuide, [512]]              # 13
  - [-1, 2, C3k2, [512, False]]                  # 14  P4 feature

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15  P4 -> up to P3
  - [[-1, 4], 1, Concat, [1]]                    # 16  concat(P4_up, P3_backbone)
  - [-1, 1, SFEContextGuide, [256]]              # 17
  - [-1, 2, C3k2, [256, False]]                  # 18  P3 feature / Out small

  - [-1, 1, Conv, [256, 3, 2]]                   # 19  down P3 -> P4
  - [[-1, 14], 1, Concat, [1]]                   # 20
  - [-1, 2, C3k2, [512, False]]                  # 21  P4 feature / Out medium

  - [-1, 1, Conv, [512, 3, 2]]                   # 22  down P4 -> P5
  - [[-1, 10], 1, Concat, [1]]                   # 23
  - [-1, 2, C3k2, [1024, True]]                  # 24  P5 feature / Out large

  - [[18, 21, 24], 1, Detect, [nc]]              # 25
