nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  - [6, 1, SFEContextGuide, [512]]      # 11 (Backbone P4 -> Context P4)
  - [4, 1, SFEContextGuide, [256]]      # 12 (Backbone P3 -> Context P3)
  - [2, 1, SFEContextGuide, [128]]      # 13 (Backbone P2 -> Context P2)

  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (P5 1/32 -> 1/16 size)
  - [[-1,11], 1, Concat, [1]]                 # 15 (与 P4 上下文特征融合)
  - [-1, 1, C3k2, [512, False]]                # 16 (融合后的 P4 特征)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (P4 1/16 -> 1/8 size)
  - [[-1,12], 1, Concat, [1]]                 # 18 (与 P3 上下文特征融合)
  - [-1, 1, C3k2, [256, False]]                # 19 (融合后的 P3 特征)
  - [[-1,16],1,StepwiseContextGuide, [4]]      # 20

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21 (P3 1/8 -> 1/4 size)
  - [[-1,13], 1, Concat, [1]]                 # 22 (与 P2 上下文特征融合)
  - [-1, 1, C3k2, [128, False]]               # 23
  - [[-1,20],1,StepwiseContextGuide, [4]]      #24

  - [[23, 20, 16], 1, Detect, [nc]]            # 25 (检测层)