nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  # ===== (a) HFCC: 1x1 compress P2-P5 -> 256 channels =====
  - [2,  1, Conv, [256, 1, 1]]          # 11: P2c (from backbone layer 2)
  - [4,  1, Conv, [256, 1, 1]]          # 12: P3c (from backbone layer 4)
  - [6,  1, Conv, [256, 1, 1]]          # 13: P4c (from backbone layer 6)
  - [10, 1, Conv, [256, 1, 1]]          # 14: P5c (from backbone layer 10)

  # ===== (b) Top-Down fusion: P5 -> P4 -> P3 -> P2 =====
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 15: P5->P4
  - [[15, 13], 1, Concat, [1]]                   # 16: (P5up + P4c)
  - [-1, 2, C3k2, [256, False]]                  # 17: T4 (top-down P4)

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]   # 18: T4->P3
  - [[18, 12], 1, Concat, [1]]                   # 19: (T4up + P3c)
  - [-1, 2, C3k2, [256, False]]                  # 20: T3 (top-down P3)

  - [20, 1, nn.Upsample, [None, 2, "nearest"]]   # 21: T3->P2
  - [[21, 11], 1, Concat, [1]]                   # 22: (T3up + P2c)
  - [-1, 2, C3k2, [256, False]]                  # 23: T2 (top-down P2)

  # ===== Bottom-Up fusion + Dense skip (concat the HFCC of target level again) =====
  - [23, 1, Conv, [256, 3, 2]]                   # 24: T2 -> P3 down
  - [[24, 20, 12], 1, Concat, [1]]               # 25: (from down + T3 + P3c)  dense skip at P3
  - [-1, 2, C3k2, [256, False]]                  # 26: B3 (bottom-up P3)

  - [26, 1, Conv, [256, 3, 2]]                   # 27: B3 -> P4 down
  - [[27, 17, 13], 1, Concat, [1]]               # 28: (down + T4 + P4c)      dense skip at P4
  - [-1, 2, C3k2, [256, False]]                  # 29: B4 (bottom-up P4)

  - [29, 1, Conv, [256, 3, 2]]                   # 30: B4 -> P5 down
  - [[30, 14], 1, Concat, [1]]                   # 31: (down + P5c)
  - [-1, 2, C3k2, [256, True]]                   # 32: B5 (bottom-up P5)

  - [[23, 26, 29, 32], 1, Detect, [nc]]