# YOLO11-TinyTarget 极小目标定制版
# 集成 HighFreqEnhance (高频增强) + MixedDown (混合下采样)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  
  # 0. Stem 层 (保持原样，处理原始输入)
  - [-1, 1, Conv, [64, 3, 2]]           # 0 (P1/2)

  # === [新增] 插入 HighFreqEnhance ===
  # 就在第0层后面，趁着图还大，把 3px 小目标的高频纹理提出来
  - [-1, 1, HighFreqEnhance, [64]]        # 1 (通道数不变)

  # === [修改] 替换 Layer 1 的 Conv 为 MixedDown ===
  # 原本是 Conv(stride=2)，现在换成 MixedDown 防止小目标丢失
  - [-1, 1, MixedConv, [128]]           # 2 (P2/4)

  # 3. C3k2 (保持原参数)
  - [-1, 2, C3k2, [256, False, 0.25]]   # 3

  # === [修改] 替换 Layer 3 的 Conv 为 MixedDown ===
  - [-1, 1, MixedConv, [256]]           # 4 (P3/8)

  # 5. C3k2
  - [-1, 2, C3k2, [512, False, 0.25]]   # 5 (注意：这是新的 P3 特征层位置)

  # === [修改] 替换 Layer 5 的 Conv 为 MixedDown ===
  - [-1, 1, MixedConv, [512]]           # 6 (P4/16)

  # 7. C3k2
  - [-1, 2, C3k2, [512, True]]          # 7 (注意：这是新的 P4 特征层位置)

  # === [修改] 替换 Layer 7 的 Conv 为 MixedDown ===
  - [-1, 1, MixedConv, [1024]]          # 8 (P5/32)

  # 9. C3k2
  - [-1, 2, C3k2, [1024, True]]         # 9

  # 10. SPPF
  - [-1, 1, SPPF, [1024, 5]]            # 10
  
  # 11. C2PSA
  - [-1, 2, C2PSA, [1024]]              # 11 (注意：这是新的 P5 特征层位置)

head:
  # === Head 部分的索引必须手动修正，因为我们在 Backbone 插入了 Layer 1 ===
  
  # 12. Upsample (原本是 11)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  
  # 13. Concat P4 
  # 原本是 [[-1, 6], ...], 现在 P4 在 Layer 7
  - [[-1, 7], 1, Concat, [1]]           # 13
  
  # 14. C3k2
  - [-1, 2, C3k2, [512, False]]         # 14

  # 15. Upsample
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  
  # 16. Concat P3
  # 原本是 [[-1, 4], ...], 现在 P3 在 Layer 5
  - [[-1, 5], 1, Concat, [1]]           # 16
  
  # 17. C3k2 (Small Head)
  - [-1, 2, C3k2, [256, False]]         # 17

  # 18. Downsample Conv
  - [-1, 1, Conv, [256, 3, 2]]          # 18
  
  # 19. Concat
  # 原本连接 Layer 13, 现在是 Layer 14
  - [[-1, 14], 1, Concat, [1]]          # 19
  
  # 20. C3k2 (Medium Head)
  - [-1, 2, C3k2, [512, False]]         # 20

  # 21. Downsample Conv
  - [-1, 1, Conv, [512, 3, 2]]          # 21
  
  # 22. Concat
  # 原本连接 Layer 10 (C2PSA), 现在是 Layer 11
  - [[-1, 11], 1, Concat, [1]]          # 22
  
  # 23. C3k2 (Large Head)
  - [-1, 2, C3k2, [1024, True]]         # 23

  # 24. Detect
  # 输入索引变为 [17, 20, 23]
  - [[17, 20, 23], 1, Detect, [nc]]     # 24