nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]            # 9-P5/32
  - [-1, 2, C2PSA, [1024]]              # 10-P5/32

head:
  - [6, 1, SFEContextGuide, [256]]      # 11 (P4 Context) - 原512改小
  - [4, 1, SFEContextGuide, [128]]      # 12 (P3 Context) - 原256改小
  - [2, 1, SFEContextGuide, [64]]       # 13 (P2 Context) - 原128改小

  - [10, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 11], 1, Concat, [1]]                 # 15
  - [-1, 1, C3k2, [512, False]]                # 16 (实际通道 128)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 12], 1, Concat, [1]]                 # 18
  - [-1, 1, C3k2, [256, False]]                # 19 (实际通道 64)
  - [[-1, 16], 1, StepwiseContextGuide, [4]]   # 20 (输出 128)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [[-1, 13], 1, Concat, [1]]                 # 22
  - [[-1, 20], 1, StepwiseContextGuide, [4]]    # 23 (输出 64)

  - [[23, 20, 16], 1, Detect, [nc]]            # 24